# Ultralytics YOLO, AGPL-3.0 license
# YOLO11 adapted from PC-YOLO11s detection-layer strategy.
# Paper: PC-YOLO11s: A Lightweight and Effective Feature Extraction Method for Small Target Image Detection
# DOI: 10.3390/s25020348
# Core change: add a high-resolution P2/4 detection branch and remove the P5/32 detection branch.
# Expected run name: yolo11_pc-p234_pretrained_mixed_dataset

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone truncated at P4/16 for small-target-focused P2/P3/P4 detection
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2/4
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4/16
  - [-1, 1, SPPF, [512, 5]] # 7
  - [-1, 2, C2PSA, [512]] # 8

# YOLO11 head with P2/P3/P4 outputs
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 11-P3/8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 14-P2/4-small

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 17-P3/8-medium

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 20-P4/16-large

  - [[14, 17, 20], 1, Detect, [nc]] # Detect(P2, P3, P4)
